In [4]:
import pandas as pd

In [5]:
json_type_data = {"record_1": ['A19Q'],
                  "record_2": ['A19Q','E22B'],
                  'record_3': ['A19Q','E22B','Q42T']}

In [6]:
records = []
for json_value in json_type_data.values():
    record = {}
    for index, item in enumerate(json_value, 1):
        record['column ' + str(index)] = item

    records.append(record)

In [7]:
df = pd.DataFrame.from_records(records)
df

  column 1 column 2 column 3
0     A19Q      NaN      NaN
1     A19Q     E22B      NaN
2     A19Q     E22B     Q42T